RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/sf_ctrl_reg.h
    /* 0x68 : sf3_if_io_dly_3 */
    union {
        struct
        {
            uint32_t sf3_io_2_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_2_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_2_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_3;

    /* 0x6C : sf3_if_io_dly_4 */
    union {
        struct
        {
            uint32_t sf3_io_3_oe_dly_sel : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7        : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t sf3_io_3_di_dly_sel : 2;  /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t sf3_io_3_do_dly_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31      : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf3_if_io_dly_4;

    /* 0x70 : sf_ctrl_2 */
    union {
        struct
        {
            uint32_t sf_if_pad_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2         : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t sf_if_pad_sel_lock : 1;  /* [    3],        r/w,        0x0 */
            uint32_t sf_if_dtr_en       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t sf_if_dqs_en       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31      : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_2;

    /* 0x74 : sf_ctrl_3 */
    union {
        struct
        {
            uint32_t sf_cmds_wrap_len   : 4;  /* [ 3: 0],        r/w,        0x6 */
            uint32_t sf_cmds_en         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t sf_cmds_bt_dly     : 3;  /* [ 7: 5],        r/w,        0x2 */
            uint32_t sf_cmds_bt_en      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t sf_cmds_wrap_q_ini : 1;  /* [    9],        r/w,        0x0 */
            uint32_t sf_cmds_wrap_mode  : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_28     : 18; /* [28:11],       rsvd,        0x0 */
            uint32_t sf_if_1_ack_lat    : 3;  /* [31:29],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_3;

    /* 0x78 : sf_if_iahb_3 */
    union {
        struct
        {
            uint32_t reserved_0_11       : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t sf_if_2_dmy_byte    : 5;  /* [16:12],        r/w,        0x0 */
            uint32_t sf_if_2_adr_byte    : 3;  /* [19:17],        r/w,        0x2 */
            uint32_t sf_if_2_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t sf_if_2_dat_rw      : 1;  /* [   23],        r/w,        0x1 */
            uint32_t sf_if_2_dat_en      : 1;  /* [   24],        r/w,        0x1 */
            uint32_t sf_if_2_dmy_en      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t sf_if_2_adr_en      : 1;  /* [   26],        r/w,        0x1 */
            uint32_t sf_if_2_cmd_en      : 1;  /* [   27],        r/w,        0x1 */
            uint32_t sf_if_2_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_2_qpi_mode_en : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_3;

    /* 0x7C : sf_if_iahb_4 */
    union {
        struct
        {
            uint32_t sf_if_2_cmd_buf_0 : 32; /* [31: 0],        r/w, 0x38000000 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_4;

    /* 0x80 : sf_if_iahb_5 */
    union {
        struct
        {
            uint32_t sf_if_2_cmd_buf_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_5;

    /* 0x84 : sf_if_iahb_6 */
    union {
        struct
        {
            uint32_t reserved_0_19       : 20; /* [19: 0],       rsvd,        0x0 */
            uint32_t sf_if_3_cmd_byte    : 3;  /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23_27      : 5;  /* [27:23],       rsvd,        0x0 */
            uint32_t sf_if_3_spi_mode    : 3;  /* [30:28],        r/w,        0x0 */
            uint32_t sf_if_3_qpi_mode_en : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_6;

    /* 0x88 : sf_if_iahb_7 */
    union {
        struct
        {
            uint32_t sf_if_3_cmd_buf_0 : 32; /* [31: 0],        r/w, 0xc0000000L */
        } BF;
        uint32_t WORD;
    } sf_if_iahb_7;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[116];

    /* 0x100 : sf_ctrl_prot_en_rd */
    union {
        struct
        {
            uint32_t sf_ctrl_prot_en_rd   : 1;  /* [    0],          r,        0x1 */
            uint32_t sf_ctrl_id0_en_rd    : 1;  /* [    1],          r,        0x1 */
            uint32_t sf_ctrl_id1_en_rd    : 1;  /* [    2],          r,        0x1 */
            uint32_t reserved_3_29        : 27; /* [29: 3],       rsvd,        0x0 */
            uint32_t sf_if_0_trig_wr_lock : 1;  /* [   30],          r,        0x0 */
            uint32_t sf_dbg_dis           : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_prot_en_rd;

    /* 0x104 : sf_ctrl_prot_en */
    union {
        struct
        {
            uint32_t sf_ctrl_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t sf_ctrl_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t sf_ctrl_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_ctrl_prot_en;

    /* 0x108  reserved */
    uint8_t RESERVED0x108[248];

    /* 0x200 : sf_aes_key_r0_0 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_0;

    /* 0x204 : sf_aes_key_r0_1 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_1;

    /* 0x208 : sf_aes_key_r0_2 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_2;

    /* 0x20C : sf_aes_key_r0_3 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_3;

    /* 0x210 : sf_aes_key_r0_4 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_4;

