RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/sf_ctrl_reg.h
    /* 0x214 : sf_aes_key_r0_5 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_5;

    /* 0x218 : sf_aes_key_r0_6 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_6;

    /* 0x21C : sf_aes_key_r0_7 */
    union {
        struct
        {
            uint32_t sf_aes_key_r0_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r0_7;

    /* 0x220 : sf_aes_iv_r0_w0 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r0_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w0;

    /* 0x224 : sf_aes_iv_r0_w1 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r0_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w1;

    /* 0x228 : sf_aes_iv_r0_w2 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r0_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w2;

    /* 0x22C : sf_aes_iv_r0_w3 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r0_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r0_w3;

    /* 0x230 : sf_aes_cfg_r0 */
    union {
        struct
        {
            uint32_t sf_aes_region_r0_end       : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t sf_aes_region_r0_start     : 14; /* [27:14],        r/w,        0x0 */
            uint32_t reserved_28                : 1;  /* [   28],       rsvd,        0x0 */
            uint32_t sf_aes_region_r0_hw_key_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_region_r0_en        : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_region_r0_lock      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_cfg_r0;

    /* 0x234  reserved */
    uint8_t RESERVED0x234[204];

    /* 0x300 : sf_aes_key_r1_0 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_0;

    /* 0x304 : sf_aes_key_r1_1 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_1;

    /* 0x308 : sf_aes_key_r1_2 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_2;

    /* 0x30C : sf_aes_key_r1_3 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_3;

    /* 0x310 : sf_aes_key_r1_4 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_4;

    /* 0x314 : sf_aes_key_r1_5 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_5;

    /* 0x318 : sf_aes_key_r1_6 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_6;

    /* 0x31C : sf_aes_key_r1_7 */
    union {
        struct
        {
            uint32_t sf_aes_key_r1_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r1_7;

    /* 0x320 : sf_aes_iv_r1_w0 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r1_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w0;

    /* 0x324 : sf_aes_iv_r1_w1 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r1_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w1;

    /* 0x328 : sf_aes_iv_r1_w2 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r1_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w2;

    /* 0x32C : sf_aes_iv_r1_w3 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r1_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w3;

    /* 0x330 : sf_aes_r1 */
    union {
        struct
        {
            uint32_t sf_aes_r1_end       : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t sf_aes_r1_start     : 14; /* [27:14],        r/w,        0x0 */
            uint32_t reserved_28         : 1;  /* [   28],       rsvd,        0x0 */
            uint32_t sf_aes_r1_hw_key_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_r1_en        : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_r1_lock      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_r1;

    /* 0x334  reserved */
    uint8_t RESERVED0x334[204];

    /* 0x400 : sf_aes_key_r2_0 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_0;

    /* 0x404 : sf_aes_key_r2_1 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_1;

    /* 0x408 : sf_aes_key_r2_2 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_2;

    /* 0x40C : sf_aes_key_r2_3 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_3;

    /* 0x410 : sf_aes_key_r2_4 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_4;

    /* 0x414 : sf_aes_key_r2_5 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_5;

    /* 0x418 : sf_aes_key_r2_6 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_6;

    /* 0x41C : sf_aes_key_r2_7 */
    union {
        struct
        {
            uint32_t sf_aes_key_r2_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_key_r2_7;

