RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/sf_ctrl_reg.h
    /* 0x420 : sf_aes_iv_r2_w0 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r2_w0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w0;

    /* 0x424 : sf_aes_iv_r2_w1 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r2_w1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w1;

    /* 0x428 : sf_aes_iv_r2_w2 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r2_w2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w2;

    /* 0x42C : sf_aes_iv_r2_w3 */
    union {
        struct
        {
            uint32_t sf_aes_iv_r2_w3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w3;

    /* 0x430 : sf_aes_r2 */
    union {
        struct
        {
            uint32_t sf_aes_r2_end       : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t sf_aes_r2_start     : 14; /* [27:14],        r/w,        0x0 */
            uint32_t reserved_28         : 1;  /* [   28],       rsvd,        0x0 */
            uint32_t sf_aes_r2_hw_key_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_r2_en        : 1;  /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_r2_lock      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_aes_r2;

    /* 0x434 : sf_id0_offset */
    union {
        struct
        {
            uint32_t sf_id0_offset  : 24; /* [23: 0],        r/w,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_id0_offset;

    /* 0x438 : sf_id1_offset */
    union {
        struct
        {
            uint32_t sf_id1_offset  : 24; /* [23: 0],        r/w,        0x0 */
            uint32_t reserved_24_31 : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sf_id1_offset;
};

typedef volatile struct sf_ctrl_reg sf_ctrl_reg_t;

/* 0x0 : sf_aes_key_0 */
#define SF_CTRL_SF_AES_KEY_0_OFFSET (0x0)
#define SF_CTRL_SF_AES_KEY_0        SF_CTRL_SF_AES_KEY_0
#define SF_CTRL_SF_AES_KEY_0_POS    (0U)
#define SF_CTRL_SF_AES_KEY_0_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_0_MSK    (((1U << SF_CTRL_SF_AES_KEY_0_LEN) - 1) << SF_CTRL_SF_AES_KEY_0_POS)
#define SF_CTRL_SF_AES_KEY_0_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_0_LEN) - 1) << SF_CTRL_SF_AES_KEY_0_POS))

/* 0x4 : sf_aes_key_1 */
#define SF_CTRL_SF_AES_KEY_1_OFFSET (0x4)
#define SF_CTRL_SF_AES_KEY_1        SF_CTRL_SF_AES_KEY_1
#define SF_CTRL_SF_AES_KEY_1_POS    (0U)
#define SF_CTRL_SF_AES_KEY_1_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_1_MSK    (((1U << SF_CTRL_SF_AES_KEY_1_LEN) - 1) << SF_CTRL_SF_AES_KEY_1_POS)
#define SF_CTRL_SF_AES_KEY_1_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_1_LEN) - 1) << SF_CTRL_SF_AES_KEY_1_POS))

/* 0x8 : sf_aes_key_2 */
#define SF_CTRL_SF_AES_KEY_2_OFFSET (0x8)
#define SF_CTRL_SF_AES_KEY_2        SF_CTRL_SF_AES_KEY_2
#define SF_CTRL_SF_AES_KEY_2_POS    (0U)
#define SF_CTRL_SF_AES_KEY_2_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_2_MSK    (((1U << SF_CTRL_SF_AES_KEY_2_LEN) - 1) << SF_CTRL_SF_AES_KEY_2_POS)
#define SF_CTRL_SF_AES_KEY_2_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_2_LEN) - 1) << SF_CTRL_SF_AES_KEY_2_POS))

/* 0xc : sf_aes_key_3 */
#define SF_CTRL_SF_AES_KEY_3_OFFSET (0xc)
#define SF_CTRL_SF_AES_KEY_3        SF_CTRL_SF_AES_KEY_3
#define SF_CTRL_SF_AES_KEY_3_POS    (0U)
#define SF_CTRL_SF_AES_KEY_3_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_3_MSK    (((1U << SF_CTRL_SF_AES_KEY_3_LEN) - 1) << SF_CTRL_SF_AES_KEY_3_POS)
#define SF_CTRL_SF_AES_KEY_3_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_3_LEN) - 1) << SF_CTRL_SF_AES_KEY_3_POS))

/* 0x10 : sf_aes_key_4 */
#define SF_CTRL_SF_AES_KEY_4_OFFSET (0x10)
#define SF_CTRL_SF_AES_KEY_4        SF_CTRL_SF_AES_KEY_4
#define SF_CTRL_SF_AES_KEY_4_POS    (0U)
#define SF_CTRL_SF_AES_KEY_4_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_4_MSK    (((1U << SF_CTRL_SF_AES_KEY_4_LEN) - 1) << SF_CTRL_SF_AES_KEY_4_POS)
#define SF_CTRL_SF_AES_KEY_4_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_4_LEN) - 1) << SF_CTRL_SF_AES_KEY_4_POS))

/* 0x14 : sf_aes_key_5 */
#define SF_CTRL_SF_AES_KEY_5_OFFSET (0x14)
#define SF_CTRL_SF_AES_KEY_5        SF_CTRL_SF_AES_KEY_5
#define SF_CTRL_SF_AES_KEY_5_POS    (0U)
#define SF_CTRL_SF_AES_KEY_5_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_5_MSK    (((1U << SF_CTRL_SF_AES_KEY_5_LEN) - 1) << SF_CTRL_SF_AES_KEY_5_POS)
#define SF_CTRL_SF_AES_KEY_5_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_5_LEN) - 1) << SF_CTRL_SF_AES_KEY_5_POS))

/* 0x18 : sf_aes_key_6 */
#define SF_CTRL_SF_AES_KEY_6_OFFSET (0x18)
#define SF_CTRL_SF_AES_KEY_6        SF_CTRL_SF_AES_KEY_6
#define SF_CTRL_SF_AES_KEY_6_POS    (0U)
#define SF_CTRL_SF_AES_KEY_6_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_6_MSK    (((1U << SF_CTRL_SF_AES_KEY_6_LEN) - 1) << SF_CTRL_SF_AES_KEY_6_POS)
#define SF_CTRL_SF_AES_KEY_6_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_6_LEN) - 1) << SF_CTRL_SF_AES_KEY_6_POS))

/* 0x1c : sf_aes_key_7 */
#define SF_CTRL_SF_AES_KEY_7_OFFSET (0x1c)
#define SF_CTRL_SF_AES_KEY_7        SF_CTRL_SF_AES_KEY_7
#define SF_CTRL_SF_AES_KEY_7_POS    (0U)
#define SF_CTRL_SF_AES_KEY_7_LEN    (32U)
#define SF_CTRL_SF_AES_KEY_7_MSK    (((1U << SF_CTRL_SF_AES_KEY_7_LEN) - 1) << SF_CTRL_SF_AES_KEY_7_POS)
#define SF_CTRL_SF_AES_KEY_7_UMSK   (~(((1U << SF_CTRL_SF_AES_KEY_7_LEN) - 1) << SF_CTRL_SF_AES_KEY_7_POS))

/* 0x20 : sf_aes_iv_w0 */
#define SF_CTRL_SF_AES_IV_W0_OFFSET (0x20)
#define SF_CTRL_SF_AES_IV_W0        SF_CTRL_SF_AES_IV_W0
#define SF_CTRL_SF_AES_IV_W0_POS    (0U)
#define SF_CTRL_SF_AES_IV_W0_LEN    (32U)
#define SF_CTRL_SF_AES_IV_W0_MSK    (((1U << SF_CTRL_SF_AES_IV_W0_LEN) - 1) << SF_CTRL_SF_AES_IV_W0_POS)
#define SF_CTRL_SF_AES_IV_W0_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_W0_LEN) - 1) << SF_CTRL_SF_AES_IV_W0_POS))

/* 0x24 : sf_aes_iv_w1 */
#define SF_CTRL_SF_AES_IV_W1_OFFSET (0x24)
#define SF_CTRL_SF_AES_IV_W1        SF_CTRL_SF_AES_IV_W1
#define SF_CTRL_SF_AES_IV_W1_POS    (0U)
#define SF_CTRL_SF_AES_IV_W1_LEN    (32U)
#define SF_CTRL_SF_AES_IV_W1_MSK    (((1U << SF_CTRL_SF_AES_IV_W1_LEN) - 1) << SF_CTRL_SF_AES_IV_W1_POS)
#define SF_CTRL_SF_AES_IV_W1_UMSK   (~(((1U << SF_CTRL_SF_AES_IV_W1_LEN) - 1) << SF_CTRL_SF_AES_IV_W1_POS))

